app/views/athletes/show.html.erb


                        <% testes = Anamnese.all %>
---
SELECT "anamneses".* FROM "anamneses"

                                  <div class='col-md-9'>
                                    <li> Avaliador: <%= User.find(teste.user_id).name %></li>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]