app/helpers/athletes_helper.rb

SELECT  "athletes".* FROM "athletes" WHERE "athletes"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
    def current_athlete
        @current_athlete ||= Athlete.find_by(id: session[:athlete_id])