app/controllers/anamneses_controller.rb

    def create
        @anamnese = Anamnese.new(anamnese_params)
        @anamnese.user_id = current_user.id

        if @anamnese.save
---
INSERT INTO "anamneses" ("main_complaint", "history_complaint", "nature_complaint", "history_injuries", "is_accompanying", "created_at", "user_id", "athletes_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"