app/controllers/athletes_controller.rb

SELECT "athletes".* FROM "athletes" WHERE (name LIKE '%Danilo Lira%')
SELECT "athletes".* FROM "athletes"
---
  def index
    if params[:name]
        @athletes = Athlete.where('name LIKE ?', "%#{params[:name]}%")
    else
        @athletes = Athlete.all

INSERT INTO "athletes" ("cpf", "date_birth", "age", "gender", "civil_status", "degree_education", "profession", "address", "city", "neighborhood", "state", "cep", "home_phone", "cell_phone", "modality", "position", "dum", "dlm", "smoker", "alcoholism", "sah", "diabetes", "cardio_deseases", "exercise_practice", "fami_alcoholism", "fami_sah", "fami_diabetes", "fami_cardio", "others", "created_at", "updated_at", "name") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30, $31, $32) RETURNING "id"
---
  def create
    @athlete = Athlete.new(athlete_params)

    if @athlete.save

SELECT  "athletes".* FROM "athletes" WHERE "athletes"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def show
    @athlete = Athlete.find(params[:id])

SELECT  "athletes".* FROM "athletes" WHERE "athletes"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "athletes" WHERE "athletes"."id" = $1  [["id", 6]]
---
  def destroy
    @athlete = Athlete.find(params[:id])
    @athlete.destroy