app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT  "users".* FROM "users" LIMIT $1  [["LIMIT", 1]]

  def update
    @user = User.find(params[:id])
    authorize! :update, @user
    if @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = $1, "avatar" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["password_digest", "$2a$10$jEynbrPaybGWdvJxpBENjeqIfb2sAmeB.UH/dczPqrsqb4XsldYZ6"], ["avatar", "<56 bytes of binary data>"], ["updated_at", "2019-05-01 03:18:35.025467"], ["id", 11]]

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest", "cpf", "date_birth", "gender", "profession", "address", "city", "neighborhood", "state", "cep", "home_phone", "cell_phone") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16) RETURNING "id"

  def destroy
    @user = User.find(params[:id])
    authorize! :destroy, @user
    @user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 14]]